# WRITE  BY @ELHYBA 
# PLUGIN FOR SourceZe
# @Source_Ze

import random
from telethon import events
import random, re

from SourceZe.utils import admin_cmd

import asyncio
from SourceZe import mody

from ..core.managers import edit_or_reply

plugin_category = "extra"

# اوامر الادمن لسورس  زد إي

@mody.ar_cmd(
    pattern="اوامر القران$",
    command=("اوامر القران ", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر القران \n۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر \n\n( `.سوره` ) \n-  تقوم باستخدام الامر + اسم السوره للحصول علي السورس\n\n( `.سوره للقارئ الشيخ` )\n - تقوم ب استخدام هذا الامر + اسم الشيخ للحصول علي سوره له\n\n( `.آيه نصيه` )\n - للحصول علي ايه نصيه عشوائيه \n۞———————﷽———————۞\n⌔︙CH : @Source_Ze "
           )
           
@mody.ar_cmd(
    pattern="اوامر الفيزات$",
    command=("اوامر الفيزات ", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الفيزات \n۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر \n\n( `.ماستر` ) \n - لتوليد ماستر كارد عشوائيه\n\n( `.فيزا` )\n - لتوليد فيزا عشوائيه\n\n( `.ولد` )\n - تقوم ب استخدام هذا الامر مع البين لتوليد 10 فيزات \n\n( `.المعلومات` )\n - استخدم الامر مع اختصار الدوله للحصول علي معلومات وهميه\n( `.جيك` )\n - تقوم ب استخدام هذا الامر لفحص الفيزا \n۞———————﷽———————۞\n⌔︙CH : @Source_Ze "
           )
           
@mody.ar_cmd(
    pattern="اوامر الاذاعه$",
    command=("اوامر الاذاعه ", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر النشر \n۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر \n\n( `.سبام` ) \n - بالزد علي الحرف لتكرار الحف\n\n( `.وسبام` )\n - بالزد علي كلمه لتكرار الكلمه\n\n( `.كرر` )\n - بالرد علي النص لتكرار النص \n\n( `.تكرار الملصق` )\n - بالرد علي الملصق لتكرار الملصق \n\n( `.ايقاف التكرار` )\n - لتعطيل التكرار \n\n( `.النشر تفعيل` )\n - لتفعيل النشر \n\n( `.نشر` )\n - بالرد علي النص المراد نشره \n\n( `.سوبر` )\n - بالرد علي النص المراد نشره بالسوبرات \n\n( `.نشر_كروبات` )\n - بالرد علي النص المراد نشره بالكروبات \n\n( `.تعطيل النشر` )\n - لتعطيل عملية النشر \n\n( `.للكل` )\n - استخدم الامر + الرساله لتتم اذاعتها للكل \n\n( `.للخاص` )\n - استخدم هذا الامر + الرساله للاذاعه لكل المحادثات الخاصه \n۞———————﷽———————۞\n⌔︙CH : @Source_Ze "
           )    
           
@mody.ar_cmd(
    pattern="اوامر المجموعات$",
    command=("اوامر المجموعات ", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الجروبات \n۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر \n\n( `.المحذوفين` ) \n - لعرض جميع الحسابات المحذوفه\n\n( `.حذف المحظورين ) \n - لحذف جميع الحسابات المحظوره من الجروب\n\n( `.ضيف` )\n - استخدم الامر مع يوزر الشخص المراد اضافته \n( `.اضف_جهاتي` )\n - لاضافة جميع جهاتك \n\n( `.طرد_الكل` )\n - لطرد جميع اعضاء المجموعه او القناه \n\n( `.كتم_الكل` )\n - لكتم جميع اعضاء الجروب \n\n( `.منع_التفليش` )\n - لمنع تفليش مجموعه او قناه \n\n( `.سماح_التفليش` )\n - لالغاء امر منع التفليش \n\n( `.تفليش` )\n - لتصفية قناه او مجموعه \n\n( `.الغاء التفليش` )\n - لايقاف عملية التفليش \n\n( `.مغادرة الكروبات` )\n - لمغادرة جميع الكروبات \n\n( `.مغادرة القنوات` )\n - لمغادرة جميع القنوات \n\n( `.تفعيل الذكاء` )\n - للسماح باستخدام الذكاء الاصطناعي \n\n( `.تعطيل الذكاء` )\n - لتعطيل استخدام الذكاء الاصطناعي \n\n( `.تفعيل المميز` )\n - للسماح ب استخدام الملصقات المميزه \n\n( `.تعطيل المميز` )\n - لتعطيل استخدام الملصقات المميزه \n\n( `.تحذير` )\n - بالرد علي الشخص لاعطائه تحذير \n\n( `.قيد` )\n - بالرد علي الشخص لتقييده \n\n( `.اضف تكرار` )\n - استخدم الامر + عدد التكرارات لعدد الحد الاقصي لتكرار الكلمه \n۞———————﷽———————۞\n⌔︙CH : @Source_Ze "
           )                                                                                   
           
@mody.ar_cmd(
    pattern="اوامر الحالات$",
    command=("اوامر الحالات ", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الحالات \n۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر \n\n( `.اوفلاين` ) \n - لتفعيل وضع ال اوفلاين \n\n( `.اونلاين` )\n - لتعطيل وضع الاوفلاين\n\n( `.سليب` )\n - قم ب استخدام الامر بالرد علي الصوره \n\n( `.نائم` )\n - لتفعيل وضع النوم \n\n( `.مستيقظ` )\n - لتعطيل وضع النوم \n۞———————﷽———————۞\n⌔︙CH : @Source_Ze "
           )
           
@mody.ar_cmd(
    pattern="اوامر التحشيش2$",
    command=("اوامر التحشيش2 ", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر التحشيش2 \n۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر \n\n( `.اجمد كده` )\n( `.يالهوي` )\n( `.احترمي نفسك` )\n( `.عيب` )\n( `.مينفش` )\n( `.مديك قلبي` )\n( `.اهلا بيك` )\n( `.هعوره` )\n( `.سليب` )\n( `.حفل` )\n( `.خد نفس` )\n( `.امال` )\n( `.هتولعو` )\n( `.انا تعبان` )\n( `.عملت ايه` )\n( `.المخدرات` )\n( `.يا مرا` )\n( `.بتحرجني` )\n( `.انضف` )\n( `.هنضحك` )\n( `.يا راجل` )\n( `.موزه` )\n( `.انا فين` )\n( `.خلصانه` )\n۞———————﷽———————۞\n⌔︙CH : @Source_Ze "
           )
           
@mody.ar_cmd(
    pattern="اوامر الزخرفه$",
    command=("اوامر الزخرفه ", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الزخرفه \n۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر \n\n( `.تغميق` ) \n - بالرد علي النص المراد جعله بالخط العريض\n\n( `.خط غامق` )\n - لتفعيل الخط الغامق\n\n( `.خط رمز` )\n - لتفعيل خط الرمز\n\n( `.زخرفه_انكليزي` )\n - لزخرفة نص باللغه الانجليزيه \n\n( `.زخرفه_عربي` )\n - لزخرفة نص باللغه العربيه \n\n( `.انجليزية` )\n - لتفعيل الزخرفة الانجليزية التلقائيه\n( `.ايقاف الانجليزية` )\n - لتعطيل الزخرفة الانجليزيه التلقائيه\n( `.زخرفة` )\n - لزخرفة نص باللغه الانجليزيه \n۞———————﷽———————۞\n⌔︙CH : @Source_Ze "
           )
           
@mody.ar_cmd(
    pattern="اوامر المساعده$",
    command=("اوامر المساعده ", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الفيزات \n۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر \n\n - الرد علي الرابط\n( `.تحويل ملكية` )\n - بالرد علي الشخص المراد نقل الملكية له\n( `.معني` )\n - قم باستخدام الامر + الاسم المراد معرفة معناه\n( `.تطبيق` )\n - قم بالرد علي رابط التطبيق\n( `.بي دي اف` )\n - لتحويل صوره لملف pdf\n( `.تفعيل الترجمة التلقائية` ) \n - لتفعيل الترجمة التلقائيه \n\n( `.انطق` )\n - بالزد علي التسحيل الصوتي \n\n( `.استفتاء` )\n - لانشاء استفتاء \n\n( `.حساب العمر` )\n - قم ب استخدام الامر + تاريخ ميلادك لحساب عمرك \n\n( `.ذك` )\n - استخدم الامر + السؤال \n\n( `.ايميل وهمي` )\n - للحصول علي بريد وهمي \n۞———————﷽———————۞\n⌔︙CH : @Source_Ze "
           )           
           
@mody.ar_cmd(
    pattern="اوامر الرشق$",
    command=("اوامر الرشق ", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الرشق \n۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر \n\n( `.تيك توك` ) \n - قم ب استخدام الامر + رابط الفيديو \n\n( `.رشق انستا` )\n - قم ب استخدام الامر + رابط المنشور \n\n( `.تفاعل` )\n - قم ب استخدام الامر + رابط البوست علي تليجرام \n\n( `.رشق` )\n - قم ب استخدام الامر + رابط البوست علي تليجرام \n۞———————﷽———————۞\n⌔︙CH : @Source_Ze "
           )
           
@mody.ar_cmd(
    pattern="اوامر المعلومات$",
    command=("اوامر المعلومات ", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر المعلومات \n۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر \n\n( `.احمد` ) \n - للحصول علي معلومات المطور \n\n( `.صورته` )\n - بالرد علب الشخص للحصول علي صورته\n\n( `.ايديه` )\n - بالرد علي الشخص للحصول علي ايديه \n\n( `.اسمه` )\n - بالرد علي الشخص للحصول علي اسمه \n\n( `.اسمي` )\n - لعرض اسمك \n\n( `.رابطه` )\n - بالرد علي الشخص \n\n( `.رابط الحساب` )\n - بالرد علي الشخص \n\n( `.ايدي الشخص` )\n - بالرد علي الشخص \n\n( `.كشف_ايدي` )\n - بالرد علي الشخص \n\n( `.الايدي` )\n - للحصول علي الايدي \n۞———————﷽———————۞\n⌔︙CH : @Source_Ze "
           )
           
@mody.ar_cmd(
    pattern="اوامر المساعده2$",
    command=("اوامر المساعده2 ", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر المساعده2 \n۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر \n\n( `.جوجل ar` ) \n - بالرد علي نص باللغه العربيه \n\n( `.جوجل en` )\n - بالرد علي نص باللغه الانجليزيه\n\n( `.بوتي` )\n - لعرض يوزر بوتك \n\n( `.تقويم` )\n - لعرض التقويم \n\n( `.انستا` )\n - قم ب استخدام الامر + رابط الفيديو \n\n( `.النظام` )\n - لعرض النظام \n\n( `.فلم` )\n - قم ب استخدام الامر + اسم الفيلم \n\n( `.تجربة` )\n - لتجربة كود برمجي \n\n( `.اسم الاغنية` )\n - بالرد علي المقطع \n\n( `.سجل الاسماء` )\n - بالرد علي الشخص \n\n( `.نزعه` )\n - قم ب استخدام الامر + اليوزر \n\n( `.السورس` )\n۞———————﷽———————۞\n⌔︙CH : @Source_Ze "
           )                       
           
@mody.ar_cmd(
    pattern="اوامر الاشتراك$",
    command=("اوامر الاشتراك ", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الاشتراك \n۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر \n\n( `.ضع الاشتراك خاص` ) \n - قم ب استخدام الامر + يوزر القناه \n\n( `.ضع الاشتراك كروب` )\n - قم ب استخدام الامر + يوزر القناه \n\n( `.تفعيل خاص` )\n - لتفعيل الاشتراك بالخاص \n\n( `.تعطيل خاص` )\n - لتعطيل الاشتراك بالخاص \n\n( `.تفعيل كروب` )\n - لتفعيل الاشتراك الكروب \n\n( `.تعطيل كروب` )\n - لتعطيل الاشتراك بالكروب \n۞———————﷽———————۞\n⌔︙CH : @Source_Ze "
           )
           
@mody.ar_cmd(
    pattern="اوامر الالعاب$",
    command=("اوامر الالعاب ", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الالعاب \n۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر \n\n( `.مصه` )\n( `.الالعاب` )\n( `.الالعاب2` )\n( `.شنو رأيك بهذا` )\n( `.اذكار` )\n( `.اذكار عشر )\n( `.كت` )\n( `.خيروك` )\n( `.مود التكبر` )\nقم ب استخدام الامر + عدد الثواني\n\n( `.مود التكبر تعطيل` )\nلتعطيل مود التكبر\n\n( `.التكبر` )\nقم ب استخدام الامر + الايدي + عدد الثواني\n\n( `.تعطيل التكبر` )\nلتعطيل امر التكبر\n۞———————﷽———————۞\n⌔︙CH : @Source_Ze "
           )
           
@mody.ar_cmd(
    pattern="اوامر الاسماء$",
    command=("اوامر الاسماء ", plugin_category),
           )
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        "شـرح عـن اوامـر الاسماء \n۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر \n\n( `.اسمي احمد` ) \n( `.اسمي عقرب` )\n۞———————﷽———————۞\n⌔︙CH : @Source_Ze "
        
)